eu.alert-project.iccs.events.core/src/test/resources/ALERT.Stardom.IdentityUpdated.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2" xmlns:wsa="http://www.w3.org/2005/08/addressing">
  <soap:Header>Header</soap:Header>
  <soap:Body>
    <wsnt:Notify>
      <wsnt:NotificationMessage>
        <wsnt:Topic>ALERT.STARDOM.IssueUpdated</wsnt:Topic>
        <wsnt:ProducerReference>
          <wsa:Address>http://www.alert-project.eu/stardom</wsa:Address>
        </wsnt:ProducerReference>
        <wsnt:Message>
          <ns1:event xmlns:ns1="http://www.alert-project.eu/" xmlns:o="http://www.alert-project.eu/ontoevents-mdservice" xmlns:r="http://www.alert-project.eu/rawevents-forum" xmlns:r1="http://www.alert-project.eu/rawevents-mailinglist" xmlns:r2="http://www.alert-project.eu/rawevents-wiki" xmlns:s="http://www.alert-project.eu/strevents-kesi" xmlns:sm="http://www.alert-project.eu/stardom" xmlns:s1="http://www.alert-project.eu/strevents-keui" xmlns:sc="http://www.alert-project.eu/socrates" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.alert-project.eu/alert-root.xsd"  >
            <ns1:head>
              <ns1:sender>STARDOM</ns1:sender>
              <ns1:timestamp>1331675854818</ns1:timestamp>
              <ns1:sequencenumber>2063254152</ns1:sequencenumber>
            </ns1:head>
            <ns1:payload>
              <ns1:meta>
                <ns1:startTime>1331675854818</ns1:startTime>
                <ns1:endTime>1331675854822</ns1:endTime>
                <ns1:eventName>ALERT.STARDOM.IssueUpdated</ns1:eventName>
                <ns1:eventId>1697944231</ns1:eventId>
                <ns1:eventType>Request</ns1:eventType>
              </ns1:meta>
              <ns1:eventData>
                <sm:identities>
                  <sm:identity>
                    <sm:uuid>51d8ecec1d6ea40106c6c71ffed13547010870b0ab57fe396f5fbb124967e0eb</sm:uuid>
                    <sm:add>
                      <sm:is>
                        <sm:person>
                          <sm:uri>http://www.alert-project.eu/ontologies/alert_scm.owl#Person1</sm:uri>
                          <sm:id>fotis@gmail.com</sm:id>
                          <sm:firstname>Fotis</sm:firstname>
                          <sm:lastname>Paraskevopoulos</sm:lastname>
                          <sm:email>fotis@gmail.com</sm:email>
                          <sm:username>fotakis</sm:username>
                        </sm:person>
                        <sm:person>
                          <sm:uri>http://www.alert-project.eu/ontologies/alert_scm.owl#Person2</sm:uri>
                        </sm:person>
                      </sm:is>
                      <sm:isnt>
                        <sm:person>
                          <sm:uri>http://www.alert-project.eu/ontologies/alert_scm.owl#Person12</sm:uri>
                        </sm:person>
                      </sm:isnt>
                    </sm:add>
                    <sm:remove>
                      <sm:is>
                        <sm:person>
                          <sm:uri>http://www.alert-project.eu/ontologies/alert_scm.owl#Person12</sm:uri>
                        </sm:person>
                      </sm:is>
                    </sm:remove>
                  </sm:identity>
                </sm:identities>
              </ns1:eventData>
            </ns1:payload>
          </ns1:event>
        </wsnt:Message>
      </wsnt:NotificationMessage>
    </wsnt:Notify>
  </soap:Body>
</soap:Envelope>